; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph3 - mode
	image0 - mode
	thermograph1 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star14 - direction
	GroundStation2 - direction
	Star9 - direction
	Star12 - direction
	GroundStation7 - direction
	Star13 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph3)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star13)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(have_image Star15 thermograph2)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 image0)
	(have_image Planet18 thermograph2)
	(have_image Phenomenon19 thermograph2)
	(have_image Star20 thermograph1)
	(have_image Planet21 image0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (calibrate satellite1 instrument2 star13)
   added: (calibrated instrument2)
   goals met: 0 of 7
3. (turn_to satellite1 planet18 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 planet18)
   goals met: 0 of 7
4. (take_image satellite1 planet18 instrument2 thermograph2)
   added: (have_image planet18 thermograph2)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon19 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 phenomenon19)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation2 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (take_image satellite1 phenomenon19 instrument2 thermograph2)
   added: (have_image phenomenon19 thermograph2)
   goals met: 2 of 7
10. (turn_to satellite0 phenomenon17 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 7
11. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 3 of 7
12. (turn_to satellite0 planet21 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet21)
   goals met: 3 of 7
13. (take_image satellite0 planet21 instrument0 image0)
   added: (have_image planet21 image0)
   goals met: 4 of 7
14. (turn_to satellite0 star16 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 star16)
   goals met: 4 of 7
15. (take_image satellite0 star16 instrument0 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 5 of 7
16. (turn_to satellite0 star20 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star20)
   goals met: 5 of 7
17. (take_image satellite0 star20 instrument0 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 6 of 7
18. (turn_to satellite1 star15 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 star15)
   goals met: 6 of 7
19. (take_image satellite1 star15 instrument2 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 7 of 7
